БухЭксп/Catalogs/CW_НастройкиFTPРесурсов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_НастройкиFTPРесурсов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Сервер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Таймаут</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/CommonModules/CW_РаботаСFTPРесурсами/Ext/Module.bsl
Функция ПодключитьсяКFTPРесурсу(НастройкиПодключения) Экспорт
	
	Если НЕ ПроверитьЗаполнениеПараметровFTP(НастройкиПодключения) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Попытка
		FTPСоединение = Новый FTPСоединение(НастройкиПодключения.Сервер, 
											НастройкиПодключения.Порт, 
											НастройкиПодключения.Логин, 
											НастройкиПодключения.Пароль,
											,
											,
											НастройкиПодключения.Таймаут); 
		
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	
	Возврат FTPСоединение;
	
КонецФункции   

Процедура ЗаполнитьНастройкиFTPРесурса(ПараметрыПодключения, FTPНастройки = Неопределено) Экспорт
	
	Если FTPНастройки = Неопределено Тогда
		FTPНастройки = FTPРесурсТехническойПоддержки();
	КонецЕсли; 
	
	Если FTPНастройки = Неопределено Тогда 
		Возврат;
	КонецЕсли;    
	
	ПараметрыПодключения.Сервер 	= FTPНастройки.Сервер;
	ПараметрыПодключения.Порт 		= FTPНастройки.Порт;
	ПараметрыПодключения.Таймаут 	= FTPНастройки.Таймаут;
	
КонецПроцедуры   

Функция ПроверитьЗаполнениеПараметровFTP(FTPНастройки = Неопределено) Экспорт
	
	Если FTPНастройки = Неопределено Тогда
		FTPНастройки = FTPРесурсТехническойПоддержки();
	КонецЕсли;  
	
	Если FTPНастройки = Неопределено Тогда 
		Возврат Ложь;
	КонецЕсли;  
	
	Возврат ЗначениеЗаполнено(FTPНастройки.Сервер) и ЗначениеЗаполнено(FTPНастройки.Порт);
	
КонецФункции


Функция FTPРесурсТехническойПоддержки() Экспорт
	
	FTPНастройки = ПредопределенноеЗначение("Справочник.CW_НастройкиFTPРесурсов.СерверОбновленийAF");
	Если FTPНастройки = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;    
	
	Возврат FTPНастройки;
	
КонецФункции

Функция ПолучитьПустуюСтруктуруНастроекFTP() Экспорт
	
	Возврат Новый Структура("Сервер,Порт,Таймаут,Логин,Пароль",,,,"","");  
	
КонецФункции
